app/controllers/alunos_controller.rb

SELECT "alunos".* FROM "alunos" WHERE ((LOWER(nome) like LOWER('%li%')))
SELECT "alunos".* FROM "alunos"
---
  def index
    if params[:query]
      @alunos = Aluno.where("(LOWER(nome) like LOWER(:query))", {query: "%#{params[:query]}%"})
    else
      @alunos = Aluno.all

SELECT "provas".* FROM "provas" WHERE "provas"."aluno_id" = $1  [["aluno_id", 1]]
SELECT 1 AS one FROM "provas" WHERE "provas"."aluno_id" = $1 LIMIT 1  [["aluno_id", 1]]
---
  def show
    if @aluno.provas.empty?

INSERT INTO "alunos" ("created_at", "nome", "turma_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 03 Dec 2013 14:35:08 BRST -02:00], ["nome", "Cesar"], ["turma_id", 1], ["updated_at", Tue, 03 Dec 2013 14:35:08 BRST -02:00]]
---
  def create
    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save

DELETE FROM "alunos" WHERE "alunos"."id" = $1  [["id", 1]]
---
  def destroy
    @aluno.destroy

SELECT "alunos".* FROM "alunos" WHERE "alunos"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_aluno
      @aluno = Aluno.find(params[:id])