app/controllers/professors_controller.rb

SELECT "professors".* FROM "professors" WHERE ((LOWER(nome) like LOWER('%ma%')))
SELECT "professors".* FROM "professors"
---
  def index
    if params[:query]
      @professors = Professor.where("(LOWER(nome) like LOWER(:query))", {query: "%#{params[:query]}%"})
    else
      @professors = Professor.all

INSERT INTO "professors" ("created_at", "formacao", "nome", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 03 Dec 2013 16:06:58 UTC +00:00], ["formacao", "Y"], ["nome", "X"], ["updated_at", Tue, 03 Dec 2013 16:06:58 UTC +00:00]]
---
  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save

UPDATE "professors" SET "nome" = $1, "formacao" = $2, "updated_at" = $3 WHERE "professors"."id" = 2  [["nome", "Mario Telles"], ["formacao", "Analise e desenvolvimento de Sistemas"], ["updated_at", Tue, 03 Dec 2013 21:47:15 BRST -02:00]]
---
  def update
    respond_to do |format|
      if @professor.update(professor_params)

DELETE FROM "professors" WHERE "professors"."id" = $1  [["id", 1]]
---
  def destroy
    @professor.destroy

SELECT "professors".* FROM "professors" WHERE "professors"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_professor
      @professor = Professor.find(params[:id])