app/controllers/turmas_controller.rb

  def index
    if params[:query]
      @turmas = Turma.where("(LOWER(nome) like LOWER(:query))", {query: "%#{params[:query]}%"})
    else
      @turmas = Turma.all
---
SELECT "turmas".* FROM "turmas" WHERE ((LOWER(nome) like LOWER('%rub%')))
SELECT "turmas".* FROM "turmas"

  def create
    @turma = Turma.new(turma_params)

    respond_to do |format|
      if @turma.save
---
INSERT INTO "turmas" ("created_at", "nome", "professor_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 03 Dec 2013 14:24:51 BRST -02:00], ["nome", "Turma Ruby"], ["professor_id", 1], ["updated_at", Tue, 03 Dec 2013 14:24:51 BRST -02:00]]

  def update
    respond_to do |format|
      if @turma.update(turma_params)
---
UPDATE "turmas" SET "nome" = $1, "updated_at" = $2 WHERE "turmas"."id" = 1  [["nome", "Turma da 3"], ["updated_at", Thu, 05 Dec 2013 21:32:03 BRST -02:00]]

  def destroy
    @turma.destroy
---
DELETE FROM "turmas" WHERE "turmas"."id" = $1  [["id", 1]]

    def set_turma
      @turma = Turma.find(params[:id])
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT 1  [["id", "3"]]